-- 1. 
-- dept_emp, department 테이블 조인하여 사원번호, 부서번호, 부서 명을 출력하세요
-- 출력하는 행의 갯수는 10개로 제한해주세요

-- 2.  shop2 db에서 id, name, price, stock, price를 조회하고 가격 * 재고로 재고 총액을 total_price 라는 별칭으로 내림차순 조회하세요

-- 3. 급여가 높은 직원이 많이 근무하는 부서를 찾으려고 합니다.

-- group_practice 데이터베이스의 tb_employees 테이블을 사용하여 다음 조건을 만족하는 부서를 조회하세요. WHERE와 HAVING을 모두 사용하세요.

-- 먼저 급여가 45,000,000원 이상인 직원만 조사 대상에 포함합니다.
-- 조사 대상 직원을 부서별로 묶습니다.
-- 조사 대상 직원이 3명 이상인 부서만 출력합니다.
-- 조사 대상 직원의 평균 급여가 50,000,000원 이상인 부서만 출력합니다.
-- 다음 정보를 출력합니다.
-- 부서명
-- 조사 대상 직원 수
-- 평균 급여
-- 최고 급여
-- 최저 급여
-- 평균 급여는 소수점 없이 반올림합니다.
-- 평균 급여가 높은 부서부터 출력합니다.

-- 4. 금일 생성한 shop2 테이블을 활용하여 아래의 내용을 출력해주세요.:)
-- 가. stock이 60개 이상인 제품을 자바 환경에서 출력
--   나.  단, stock의 경우 컬럼명을 한글인 '재고수'로 출력

-- 5. 
-- employees 테이블을 사용해 1999년도에 입사한 사람들 중 생년월일이 빠른 순으로 10명을 출력하세요.

-- [조건]
-- 사번, 이름, 성별, 생년월일을 조회하되, 이름은 성과 이름을 합쳐서 한 번에 출력하세요.

-- 6. 자바에서 employees DB의 salaries 테이블에서 emp_no와 사원번호(emp_no)의 평균 급여를 조회하세요.
-- -emp_no를 기준으로 그룹화하세요.
-- -salary의 평균을 구하고, 평균 급여는 소수점 둘째 자리까지 출력하세요.
-- -Scanner를 이용하여 입력받은 사원 번호보다 작은 경우만 조회하세요.

-- 7. employees 데이터베이스의 dept_emp(사원-부서 배치 이력)와 departments(부서 정보) 테이블을 활용하여, 

-- 각 부서에 소속되었던 인원이 몇 명인지 집계하고, 인원이 가장 많은 상위 5개 부서만 조회해주세요.

-- 결과에는 부서 번호, 부서명, 인원 수가 모두 나타나야 합니다.

-- 8. 
-- employees DB의 employees , salaries 테이블을 이용하여 hire_date가 1990년 이전 인 사람들의 남,여 평균 급여를 조회하세요.
-- 이미지는 출력결과입니다.(디스코드 확인)

-- 9. 
-- titles 테이블을 사용하여 현재 재직중인 직원의 수가 10,000명 이상인 직무(title)와 해당 직무의 직원 수(cnt)를 조회하는 쿼리를 작성하세요.

-- 10. employees의 salaries를 이용해 특정 사원 번호를 입력받고 해당 사원의 월급 5건이 출력되는 코드를 작성해주세요



